Repository: KsArt-IT/ToDoList-Firebase-SwiftUI-iOS
Catalog: ToDoList-SUI/Resources/Localizable.xcstrings
Source language: en
Languages: ru, uk

source: A user with this email does not exist.
ru: Пользователь с таким email не существует.
uk: Користувач із таким email не існує.

source: Add your first task!
ru: Добавьте свою первую задачу!
uk: Додайте своє перше завдання!

source: Authorization
ru: Авторизация
uk: Авторизація

source: Completed
ru: Выполнено
uk: Виконано

source: Confirm password
ru: Подтвердите пароль
uk: Підтвердьте пароль

source: Database is not connected.
ru: База данных не подключена.
uk: База даних не підключена.

source: Date
ru: Дата
uk: Дата

source: Decoding failed with error
ru: Ошибка декодирования
uk: Помилка декодування

source: Delete
ru: Удалить
uk: Видалити

source: Edit
ru: Редактировать
uk: Редагувати

source: Empty
ru: Нет задач
uk: Немає завдань

source: Enter the task name!
ru: Введите название задачи!
uk: Введіть назву завдання!

source: Error
ru: Ошибка
uk: Помилка

source: female
ru: женский
uk: жіноча

source: Forgot your password?
ru: Забыли пароль?
uk: Забули пароль?

source: Important task
ru: Важная задача
uk: Важливе завдання

source: Incorrect password entered.
ru: Введен неверный пароль.
uk: Введено неправильний пароль.

source: Info
ru: Информация
uk: Інформація

source: Invalid email format.
ru: Неверный формат адреса электронной почты.
uk: Недійсний формат електронної пошти.

source: Login
ru: Войти
uk: Увійти

source: Logout
ru: Выйти
uk: Вийти

source: male
ru: мужской
uk: чоловічий

source: Network error occurred
ru: Произошла ошибка сети
uk: Сталася помилка мережі

source: New task
ru: Новая задача
uk: Нове завдання

source: other
ru: другой
uk: інший

# password recovery
source: A password recovery request has been sent to your email!
ru: На ваш email был отправлен запрос на восстановления пароля!
uk: На ваш email було надіслано запит на відновлення пароля!

source: passwords do not match
ru: пароли не совпадают
uk: паролі не збігаються

source: Profile
ru: Профиль
uk: Профіль

source: Register
ru: Зарегистрироваться
uk: Зареєструватись

source: Registration
ru: Регистрация
uk: Реєстрація

source: Reset password
ru: Сбросить пароль
uk: Скинути пароль

source: Save
ru: Сохранить
uk: Зберегти

source: Sign in with Google account
ru: Войти с учетной записью Google
uk: Увійти з обліковим записом Google

source: SignUp
ru: Зарегистрироваться
uk: Реєстрація

source: Successful authorization
ru: Успешная авторизация
uk: Успішна авторизація

source: Successful registration
ru: Успешная регистрация
uk: Успішна реєстрація

# Task Active
source: Active tasks
ru: Активные задачи
uk: Активних завдань

source: Task Completed
ru: Выполненные задачи
uk: Виконані завдання

# Task Created
source: Created tasks
ru: Создано задач
uk: Створено завдань

# Task Deleted
source: Tasks removed
ru: Удалено задач
uk: Видалено завдань

source: Task text
ru: Текст задачи
uk: Текст завдання

# Task title
source: Enter a new task
ru: Введите новую задачу
uk: Введіть нове завдання

source: The password is too weak.
ru: Пароль слишком слабый.
uk: Пароль занадто слабкий.

source: The request is invalid.
ru: Запрос недействителен.
uk: Запит недійсний.

source: The response is invalid.
ru: Ответ недействителен.
uk: Відповідь недійсна.

source: The supplied auth credential is malformed or has expired.
ru: Предоставленные учетные данные аутентификации неверны или срок их действия истек.
uk: Надані облікові дані автентифікації неправильні або термін їх дії минув.

source: The user account has been blocked.
ru: Учетная запись пользователя заблокирована.
uk: Обліковий запис користувача заблоковано.

source: This email is already in use.
ru: Этот адрес электронной почты уже используется.
uk: Ця електронна адреса вже використовується.

source: Time
ru: Время
uk: Час

# Title Reset password
source: Reset password
ru: Сброс пароля
uk: Скидання пароля

source: To Do List
ru: Список задач
uk: Список завдань

source: Type email
ru: Введите email
uk: Введіть email

source: Type password
ru: Введите пароль
uk: Введіть пароль

source: Unexpected status code
ru: Неожиданный код статуса
uk: Неочікуваний код стану
